openfoam/turek_cylinderA_validated/system/blockMeshDict_rect
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// =====================================================
// Géométrie Turek
// =====================================================

vertices
(
    // z = 0

    (0.00 0.00 0)    // 0
    (0.15 0.00 0)    // 1
    (0.25 0.00 0)    // 2
    (2.50 0.00 0)    // 3

    (0.00 0.15 0)    // 4
    (0.15 0.15 0)    // 5
    (0.25 0.15 0)    // 6
    (2.50 0.15 0)    // 7

    (0.00 0.25 0)    // 8
    (0.15 0.25 0)    // 9
    (0.25 0.25 0)    // 10
    (2.50 0.25 0)    // 11

    (0.00 0.41 0)    // 12
    (0.15 0.41 0)    // 13
    (0.25 0.41 0)    // 14
    (2.50 0.41 0)    // 15

    // z = 0.01

    (0.00 0.00 0.01)    //16
    (0.15 0.00 0.01)    //17
    (0.25 0.00 0.01)    //18
    (2.50 0.00 0.01)    //19

    (0.00 0.15 0.01)    //20
    (0.15 0.15 0.01)    //21
    (0.25 0.15 0.01)    //22
    (2.50 0.15 0.01)    //23

    (0.00 0.25 0.01)    //24
    (0.15 0.25 0.01)    //25
    (0.25 0.25 0.01)    //26
    (2.50 0.25 0.01)    //27

    (0.00 0.41 0.01)    //28
    (0.15 0.41 0.01)    //29
    (0.25 0.41 0.01)    //30
    (2.50 0.41 0.01)    //31
);

blocks
(
    // bas amont
    hex (0 1 5 4 16 17 21 20)
    (20 15 1)
    simpleGrading (1 1 1)

    // bas cylindre
    hex (1 2 6 5 17 18 22 21)
    (20 15 1)
    simpleGrading (1 1 1)

    // bas aval
    hex (2 3 7 6 18 19 23 22)
    (180 15 1)
    simpleGrading (1 1 1)

    // milieu amont
    hex (4 5 9 8 20 21 25 24)
    (20 20 1)
    simpleGrading (1 1 1)

    // milieu cylindre
    hex (5 6 10 9 21 22 26 25)
    (20 20 1)
    simpleGrading (1 1 1)

    // milieu aval
    hex (6 7 11 10 22 23 27 26)
    (180 20 1)
    simpleGrading (1 1 1)

    // haut amont
    hex (8 9 13 12 24 25 29 28)
    (20 16 1)
    simpleGrading (1 1 1)

    // haut cylindre
    hex (9 10 14 13 25 26 30 29)
    (20 16 1)
    simpleGrading (1 1 1)

    // haut aval
    hex (10 11 15 14 26 27 31 30)
    (180 16 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 20 16)
            (4 8 24 20)
            (8 12 28 24)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)

            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)

            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }

    back
    {
        type empty;
        faces
        (
            (16 20 21 17)
            (17 21 22 18)
            (18 22 23 19)

            (20 24 25 21)
            (21 25 26 22)
            (22 26 27 23)

            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
        );
    }
);

mergePatchPairs();
