openfoam/turek_cylinderA_validated/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type zeroGradient;
    }

    outlet
    {
        type fixedValue;
        value uniform 0;
    }

    bottomWall
    {
        type zeroGradient;
    }

    topWall
    {
        type zeroGradient;
    }

    cylinder
    {
        type zeroGradient;
    }

    beam
    {
        type zeroGradient;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}
